spec/cassettes/SignupService/_call/when_all_goes_well/creates_an_account.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=bob%40example.com&source=tok_1CrbLWFuGCUWqFqFr5BHz2Uy
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.17.0
      Authorization:
      - Bearer REDACTED
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.17.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Daniels-MacBook-Air.local 15.6.0 Darwin Kernel Version 15.6.0: Tue Jan 30
        11:45:51 PST 2018; root:xnu-3248.73.8~1/RELEASE_X86_64 x86_64","hostname":"Daniels-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 25 Jul 2018 01:01:24 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1429'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_5eG05vjgoJEW64
      Stripe-Version:
      - '2018-05-21'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_DIBlErTW5414LT",
          "object": "customer",
          "account_balance": 0,
          "created": 1532480483,
          "currency": null,
          "default_source": "card_1CrbLWFuGCUWqFqFI2035AI6",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "bob@example.com",
          "invoice_prefix": "1942373",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1CrbLWFuGCUWqFqFI2035AI6",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "55443",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_DIBlErTW5414LT",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2021,
                "fingerprint": "eyOJiDPWcsMpo0dd",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_DIBlErTW5414LT/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_DIBlErTW5414LT/subscriptions"
          }
        }
    http_version:
  recorded_at: Wed, 25 Jul 2018 01:01:24 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/subscriptions
    body:
      encoding: UTF-8
      string: customer=cus_DIBlErTW5414LT&items[0][plan]=one-and-done-development&trial_end=1534294884
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.17.0
      Authorization:
      - Bearer REDACTED
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.17.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Daniels-MacBook-Air.local 15.6.0 Darwin Kernel Version 15.6.0: Tue Jan 30
        11:45:51 PST 2018; root:xnu-3248.73.8~1/RELEASE_X86_64 x86_64","hostname":"Daniels-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 25 Jul 2018 01:01:25 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2169'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_iagshmUgci6hl1
      Stripe-Version:
      - '2018-05-21'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_DIBlijJ1izORBZ",
          "object": "subscription",
          "application_fee_percent": null,
          "billing": "charge_automatically",
          "billing_cycle_anchor": 1534294884,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "created": 1532480484,
          "current_period_end": 1534294884,
          "current_period_start": 1532480484,
          "customer": "cus_DIBlErTW5414LT",
          "days_until_due": null,
          "discount": null,
          "ended_at": null,
          "items": {
            "object": "list",
            "data": [
              {
                "id": "si_DIBlmVnq5hKDdJ",
                "object": "subscription_item",
                "created": 1532480485,
                "metadata": {},
                "plan": {
                  "id": "one-and-done-development",
                  "object": "plan",
                  "active": true,
                  "aggregate_usage": null,
                  "amount": 3900,
                  "billing_scheme": "per_unit",
                  "created": 1531797206,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "nickname": "One and Done",
                  "product": "prod_DFE5sMkOQFQngD",
                  "tiers": null,
                  "tiers_mode": null,
                  "transform_usage": null,
                  "trial_period_days": 21,
                  "usage_type": "licensed"
                },
                "quantity": 1,
                "subscription": "sub_DIBlijJ1izORBZ"
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/subscription_items?subscription=sub_DIBlijJ1izORBZ"
          },
          "livemode": false,
          "metadata": {},
          "plan": {
            "id": "one-and-done-development",
            "object": "plan",
            "active": true,
            "aggregate_usage": null,
            "amount": 3900,
            "billing_scheme": "per_unit",
            "created": 1531797206,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "nickname": "One and Done",
            "product": "prod_DFE5sMkOQFQngD",
            "tiers": null,
            "tiers_mode": null,
            "transform_usage": null,
            "trial_period_days": 21,
            "usage_type": "licensed"
          },
          "quantity": 1,
          "start": 1532480484,
          "status": "trialing",
          "tax_percent": null,
          "trial_end": 1534294884,
          "trial_start": 1532480484
        }
    http_version:
  recorded_at: Wed, 25 Jul 2018 01:01:25 GMT
recorded_with: VCR 3.0.3
